tutorials/compressible/rhoSimpleFoam/gasMixing/injectorPipe/Allrun.mesh
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication surfaceFeatureExtract

runApplication blockMesh

runApplication decomposePar

runParallel snappyHexMesh -overwrite

rm -rf 0

#------------------------------------------------------------------------------
